prototype/app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "record"]]
---
  def show
    @game = Game.find(params[:id])

SELECT "players".* FROM "players" ORDER BY name ASC
---
  def new
    @players = Player.order('name ASC')