prototype/app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @players = Player.all

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "photo"]]
---
  def show
    @player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def photo
    player = Player.find(params[:id])